---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsUndersideSurfaceStyle
source: html/02299593-1c88-63a3-65f2-99cf5254386f.htm
---
# Autodesk.Revit.DB.Architecture.StairsUndersideSurfaceStyle

The style of the underside surface of the run.

## Syntax (C#)
```csharp
public enum StairsUndersideSurfaceStyle
```